blank_case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (2 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            symmetryPlane;
    }
    ground
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (20 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    side
    {
        type            symmetryPlane;
    }
    side2
    {
        type            symmetryPlane;
    }
    airfoil
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
   
}


// ************************************************************************* //
